// В драконьем замке каждый день рождается
// 1-2 чёрных дракона, 3-4 красных и 3-4 зелёных.
// Известно, что в те месяцы, в которых 31 день
// рождается больше зелёных драконов, а в которые
// 30 дней, рождается больше красных. И только в
// феврале рождается максимальное количество чёрных
// драконов, зато прирост красных и зелёных драконов
// в феврале минимальный.
//
// Для решения задачи используйте инструкцию switch,
// тип перечисление (enum), пространства имён (namespaces),
// арифметические операции и циклы, ввод/вывод из iostream
//
// Выведите на консоль количество драконов по цветам в каждом месяце.
// Выведите на консоль общее число драконов по цветам за год.

#ifndef EX3_DRAGONS_H
#define EX3_DRAGONS_H

inline void show_number_of_dragons()
{
//TODO: implement this
}

#endif // EX3_DRAGONS_H
