// Лякуша Бамбай старый космический пират за свою карьеру
// ограбил немало феян, людей и гаальцев, но всегда обходил
// стороной малоков. Спустя много лет странствий он наконец
// решил уйти на покой и открыть небольшой бар под названием
// "Сундук мертвеца" на крупной малокской военной базе на
// планете Коршунт в созвездии Анакондор. Для этого пришлось
// подкупить тамошнего губернатора и шефа полиции и теперь
// Лякуша Бамбай отстёгивает губернатору 10% от каждой покупки
// а шефу полиции 5%. Но старый хитрец не хочет терять своей
// выгоды, за долгие годы космический скитаний и нескончаемой
// вереницы грабежей и стычек с другими пиратами он привык
// платить из чужого кармана, а не из своего. Поэтому он решил
// включить взятки для губернатора и шефа полиции в цену товаров.
// Известно, что Лякуша Бамбай решил продавать феянский пунш по
// 5 кредитов за кружку, пеленгское пиво по 6 кредитов за кружку,
// малокский ром по 8 кредитов за кружку, а гаальский виски по
// 10 кредитов за кружку. Редкое в этих краях зелено вино расы
// людей он решил продавать по 15 кредитов за кружку.
// Помогите Лякуше Бамбаю составить винную карту (как часть
// меню), правильно повысив цены, чтобы хватило на отступные
// для губернатора и шефа полиции.
// Реализуйте программу в виде интерактивного диалога с
// посетителем бара, дав ему возможность выбрать напиток по
// своему выбору. В случае ошибки, дайте посетителю
// возможность повторного выбора.
// Для решения задачи допускается использование инструкции
// if-else, пользовательских функций, цикла while, ключевых слов
// continue, break и return, логических операторов и средств
// заголовочного файла iostream для ввода и вывода.

#ifndef EX2_PIRATE_BAR_H
#define EX2_PIRATE_BAR_H

#include <iostream>

inline void choose_drink()
{
//TODO: implement this
}

#endif // EX2_PIRATE_BAR_H
